app/controllers/candidates_controller.rb

SELECT "candidates".* FROM "candidates" WHERE "candidates"."id" = ? LIMIT 1  [["id", "6"]]
---
    def vote_up_voter
      @candidate = Candidate.find(params[:id])

SELECT "candidates".* FROM "candidates" WHERE "candidates"."id" = ? LIMIT 1  [["id", "8"]]
---
    def vote_up_admin
      @candidate = Candidate.find(params[:id])

SELECT "candidates".* FROM "candidates" WHERE "candidates"."id" = ? LIMIT 1  [["id", "2"]]
---
  def show
    @candidate = Candidate.find(params[:id])

SELECT "candidates".* FROM "candidates" WHERE "candidates"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @candidate = Candidate.find(params[:id])

INSERT INTO "candidates" ("name") VALUES (?)  [["name", "Goldfish"]]
---
  def create
    @candidate = Candidate.new(params[:candidate])

    respond_to do |format|
      if @candidate.save

SELECT "candidates".* FROM "candidates" WHERE "candidates"."id" = ? LIMIT 1  [["id", "2"]]
---
  def update
    @candidate = Candidate.find(params[:id])

SELECT "candidates".* FROM "candidates" WHERE "candidates"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "candidates" WHERE "candidates"."id" = ?  [["id", 1]]
---
  def destroy
    @candidate = Candidate.find(params[:id])
    @candidate.destroy